```
22:22:10.423 STDOUT terraform: Terraform will perform the following actions:
22:22:10.423 STDOUT terraform:   # aws_acm_certificate.primary must be replaced
22:22:10.423 STDOUT terraform: +/- resource "aws_acm_certificate" "primary" {
22:22:10.423 STDOUT terraform:       ~ arn                       = "arn:aws:acm:us-east-2:351621253146:certificate/8cdc96b2-d379-4371-bfc8-1ab79a043d0d" -> (known after apply)
22:22:10.423 STDOUT terraform:       ~ domain_validation_options = [
22:22:10.423 STDOUT terraform:           - {
22:22:10.423 STDOUT terraform:               - domain_name           = "bors-prod.rust-lang.net"
22:22:10.423 STDOUT terraform:               - resource_record_name  = "_9bf76654d156f338d1c4cd86679ef863.bors-prod.rust-lang.net."
22:22:10.423 STDOUT terraform:               - resource_record_type  = "CNAME"
22:22:10.423 STDOUT terraform:               - resource_record_value = "_cbbeef41e2e8d379c919be5da3190470.sdgjtdhdhz.acm-validations.aws."
22:22:10.423 STDOUT terraform:             },
22:22:10.423 STDOUT terraform:           + {
22:22:10.423 STDOUT terraform:               + domain_name           = "bors-prod.rust-lang.net"
22:22:10.423 STDOUT terraform:               + resource_record_name  = (known after apply)
22:22:10.423 STDOUT terraform:               + resource_record_type  = (known after apply)
22:22:10.423 STDOUT terraform:               + resource_record_value = (known after apply)
22:22:10.424 STDOUT terraform:             },
22:22:10.424 STDOUT terraform:           + {
22:22:10.424 STDOUT terraform:               + domain_name           = "bors.rust-lang.org"
22:22:10.424 STDOUT terraform:               + resource_record_name  = (known after apply)
22:22:10.424 STDOUT terraform:               + resource_record_type  = (known after apply)
22:22:10.424 STDOUT terraform:               + resource_record_value = (known after apply)
22:22:10.424 STDOUT terraform:             },
22:22:10.424 STDOUT terraform:         ]
22:22:10.424 STDOUT terraform:       ~ id                        = "arn:aws:acm:us-east-2:351621253146:certificate/8cdc96b2-d379-4371-bfc8-1ab79a043d0d" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ key_algorithm             = "RSA_2048" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ not_after                 = "2026-06-28T23:59:59Z" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ not_before                = "2025-05-30T00:00:00Z" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ pending_renewal           = false -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ renewal_summary           = [
22:22:10.424 STDOUT terraform:           - {
22:22:10.424 STDOUT terraform:               - renewal_status        = "SUCCESS"
22:22:10.424 STDOUT terraform:               - renewal_status_reason = ""
22:22:10.424 STDOUT terraform:               - updated_at            = "2025-05-30T00:24:07Z"
22:22:10.424 STDOUT terraform:             },
22:22:10.424 STDOUT terraform:         ] -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ status                    = "ISSUED" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ subject_alternative_names = [ # forces replacement
22:22:10.424 STDOUT terraform:           + "bors.rust-lang.org",
22:22:10.424 STDOUT terraform:             # (1 unchanged element hidden)
22:22:10.424 STDOUT terraform:         ]
22:22:10.424 STDOUT terraform:       - tags                      = {} -> null
22:22:10.424 STDOUT terraform:       ~ tags_all                  = {} -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ type                      = "AMAZON_ISSUED" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ validation_emails         = [] -> (known after apply)
22:22:10.424 STDOUT terraform:         # (2 unchanged attributes hidden)
22:22:10.424 STDOUT terraform:       - options {
22:22:10.424 STDOUT terraform:           - certificate_transparency_logging_preference = "ENABLED" -> null
22:22:10.424 STDOUT terraform:         }
22:22:10.424 STDOUT terraform:     }
22:22:10.424 STDOUT terraform:   # aws_acm_certificate_validation.primary must be replaced
22:22:10.424 STDOUT terraform: -/+ resource "aws_acm_certificate_validation" "primary" {
22:22:10.424 STDOUT terraform:       ~ certificate_arn         = "arn:aws:acm:us-east-2:351621253146:certificate/8cdc96b2-d379-4371-bfc8-1ab79a043d0d" # forces replacement -> (known after apply) # forces replacement
22:22:10.424 STDOUT terraform:       ~ id                      = "2024-06-29 18:22:26.74 +0000 UTC" -> (known after apply)
22:22:10.424 STDOUT terraform:       ~ validation_record_fqdns = [ # forces replacement
22:22:10.424 STDOUT terraform:           - "_9bf76654d156f338d1c4cd86679ef863.bors-prod.rust-lang.net",
22:22:10.424 STDOUT terraform:         ] -> (known after apply) # forces replacement
22:22:10.425 STDOUT terraform:     }
22:22:10.425 STDOUT terraform:   # aws_lb_listener.primary will be updated in-place
22:22:10.425 STDOUT terraform:   ~ resource "aws_lb_listener" "primary" {
22:22:10.425 STDOUT terraform:       ~ certificate_arn   = "arn:aws:acm:us-east-2:351621253146:certificate/8cdc96b2-d379-4371-bfc8-1ab79a043d0d" -> (known after apply)
22:22:10.425 STDOUT terraform:         id                = "arn:aws:elasticloadbalancing:us-east-2:351621253146:listener/net/bors/118550dbd9fc8d48/51d1b1c84bfbb7ad"
22:22:10.425 STDOUT terraform:         tags              = {}
22:22:10.425 STDOUT terraform:         # (7 unchanged attributes hidden)
22:22:10.425 STDOUT terraform:         # (1 unchanged block hidden)
22:22:10.425 STDOUT terraform:     }
22:22:10.425 STDOUT terraform:   # aws_route53_record.acm_validation["bors-prod.rust-lang.net"] must be replaced
22:22:10.425 STDOUT terraform: -/+ resource "aws_route53_record" "acm_validation" {
22:22:10.425 STDOUT terraform:       ~ fqdn                             = "_9bf76654d156f338d1c4cd86679ef863.bors-prod.rust-lang.net" -> (known after apply)
22:22:10.425 STDOUT terraform:       ~ id                               = "Z00538663HGOB9BGAECJD__9bf76654d156f338d1c4cd86679ef863.bors-prod.rust-lang.net._CNAME" -> (known after apply)
22:22:10.425 STDOUT terraform:       - multivalue_answer_routing_policy = false -> null
22:22:10.425 STDOUT terraform:       ~ name                             = "_9bf76654d156f338d1c4cd86679ef863.bors-prod.rust-lang.net" # forces replacement -> (known after apply) # forces replacement
22:22:10.425 STDOUT terraform:       ~ records                          = [
22:22:10.425 STDOUT terraform:           - "_cbbeef41e2e8d379c919be5da3190470.sdgjtdhdhz.acm-validations.aws.",
22:22:10.425 STDOUT terraform:         ] -> (known after apply)
22:22:10.425 STDOUT terraform:       ~ type                             = "CNAME" -> (known after apply)
22:22:10.425 STDOUT terraform:         # (3 unchanged attributes hidden)
22:22:10.425 STDOUT terraform:     }
22:22:10.425 STDOUT terraform:   # aws_route53_record.acm_validation["bors.rust-lang.org"] will be created
22:22:10.425 STDOUT terraform:   + resource "aws_route53_record" "acm_validation" {
22:22:10.425 STDOUT terraform:       + allow_overwrite = true
22:22:10.425 STDOUT terraform:       + fqdn            = (known after apply)
22:22:10.425 STDOUT terraform:       + id              = (known after apply)
22:22:10.425 STDOUT terraform:       + name            = (known after apply)
22:22:10.425 STDOUT terraform:       + records         = (known after apply)
22:22:10.425 STDOUT terraform:       + ttl             = 60
22:22:10.425 STDOUT terraform:       + type            = (known after apply)
22:22:10.425 STDOUT terraform:       + zone_id         = "Z00538663HGOB9BGAECJD"
22:22:10.425 STDOUT terraform:     }
22:22:10.425 STDOUT terraform: Plan: 4 to add, 1 to change, 3 to destroy.
```